tutorials/lagrangian/reactingParcelFilmFoam/panel/Allrun.pre
#!/bin/sh
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh

runApplication setSet -batch wallFilmRegion.setSet
mv log.setSet log.wallFilmRegion.setSet

runApplication extrudeToRegionMesh wallFilmRegion '(wallFilmFaces)' 0.01 -overwrite

runApplication setSet -region wallFilmRegion -batch createWallFilmRegionPatches.setSet
mv log.setSet log.createWallFilmRegionPatches.setSet

runApplication createPatch -region wallFilmRegion -overwrite

