tutorials/lagrangian/reactingParcelFilmFoam/panel/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev.FMGlobal                          |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

2
(
    walls
    {
        type            wall;
        nFaces          700;
        startFace       1150;
    }
    region0_to_wallFilmRegion_wallFilmFaces
    {
        type            directMappedWall;
        nFaces          600;
        startFace       1850;
        sampleMode      nearestPatchFace;
        sampleRegion    wallFilmRegion;
        samplePatch     region0_to_wallFilmRegion_wallFilmFaces;
        offsets         
600
(
(-0 -1.734723476e-18 -0)
(-0 -1.734723476e-18 -0)
(-1.387778781e-17 1.734723476e-18 -0)
(-0 -0 -0)
(-0 -0 -0)
(-0 -3.469446952e-18 -0)
(-0 3.469446952e-18 -0)
(-1.387778781e-17 -0 -0)
(-0 -3.469446952e-18 -0)
(-0 3.469446952e-18 -0)
(-1.387778781e-17 -3.469446952e-18 -0)
(-0 3.469446952e-18 -0)
(-1.387778781e-17 -0 -0)
(-0 -0 -0)
(-1.387778781e-17 -6.938893904e-18 -0)
(-0 6.938893904e-18 -0)
(-0 -0 -0)
(-1.387778781e-17 6.938893904e-18 -0)
(-0 6.938893904e-18 -0)
(-0 -0 -0)
(-0 -0 -0)
(-1.387778781e-17 -6.938893904e-18 -0)
(-0 -6.938893904e-18 -0)
(-1.387778781e-17 -6.938893904e-18 -0)
(-0 -2.168404345e-19 -0)
(-0 8.67361738e-19 -0)
(-1.387778781e-17 -0 -0)
(-2.775557562e-17 -8.67361738e-19 -0)
(-0 -0 -0)
(-0 -0 -0)
(-0 -1.734723476e-18 -0)
(-0 -1.734723476e-18 -0)
(-0 1.734723476e-18 -0)
(-0 -3.469446952e-18 -0)
(2.775557562e-17 -0 -0)
(-0 -6.938893904e-18 -0)
(-0 -6.938893904e-18 -0)
(-0 -0 -0)
(-0 -6.938893904e-18 -0)
(-0 -0 -0)
(-0 -6.938893904e-18 -0)
(-0 -1.040834086e-17 -0)
(-1.387778781e-17 3.469446952e-18 -0)
(-0 -6.938893904e-18 -0)
(1.387778781e-17 -0 -0)
(-0 -0 -0)
(-0 -0 -0)
(-1.387778781e-17 6.938893904e-18 -0)
(-0 -6.938893904e-18 -0)
(-1.387778781e-17 -6.938893904e-18 -0)
(1.387778781e-17 6.938893904e-18 -0)
(-0 -6.938893904e-18 -0)
(-0 -1.387778781e-17 -0)
(1.387778781e-17 6.938893904e-18 -0)
(-0 -0 -0)
(-0 -8.67361738e-19 -0)
(-0 -0 -0)
(-0 8.67361738e-19 -0)
(-0 -8.67361738e-19 -0)
(-0 -0 -0)
(-1.387778781e-17 -1.734723476e-18 -0)
(-0 -1.734723476e-18 -0)
(1.387778781e-17 1.734723476e-18 -0)
(-1.387778781e-17 -0 -0)
(-0 -0 -0)
(-1.387778781e-17 -3.469446952e-18 -0)
(-1.387778781e-17 3.469446952e-18 -0)
(-0 -0 -0)
(-1.387778781e-17 -3.469446952e-18 -0)
(-0 3.469446952e-18 -0)
(-0 -3.469446952e-18 -0)
(-1.387778781e-17 3.469446952e-18 -0)
(-0 -0 -0)
(-1.387778781e-17 -0 -0)
(-1.387778781e-17 -6.938893904e-18 -0)
(-0 6.938893904e-18 -0)
(-1.387778781e-17 -0 -0)
(-0 6.938893904e-18 -0)
(-0 6.938893904e-18 -0)
(-0 -0 -0)
(-0 -0 -0)
(-0 -6.938893904e-18 -0)
(-1.387778781e-17 -6.938893904e-18 -0)
(-1.387778781e-17 -6.938893904e-18 -0)
(-0 -0 -0)
(1.387778781e-17 -8.67361738e-19 -0)
(-1.387778781e-17 -0 -0)
(-1.387778781e-17 8.67361738e-19 -0)
(-0 -8.67361738e-19 -0)
(-1.387778781e-17 -0 -0)
(-1.387778781e-17 -1.734723476e-18 -0)
(-1.387778781e-17 -1.734723476e-18 -0)
(-0 1.734723476e-18 -0)
(1.387778781e-17 -0 -0)
(-2.775557562e-17 -0 -0)
(1.387778781e-17 -3.469446952e-18 -0)
(-1.387778781e-17 3.469446952e-18 -0)
(-1.387778781e-17 -0 -0)
...
)
;
    }
)

// ************************************************************************* //
